import random

def fi(n):
    f = n
    if n%2 == 0:
        while n%2 == 0:
            n = n // 2
        f = f // 2
    i = 3
    while i*i <= n:
        if n%i == 0:
            while n%i == 0:
                n = n // i
            f = f // i
            f = f * (i-1)
        i = i + 2
    if n > 1:
        f = f // n
        f = f * (n-1)
    return f

def error_fi(n,t):
    i = (fi(n)/n)**t
    print(fi(n))
    print(f'Вероятность ошибки = {i}')

def test_ferma_count(n, t):
    for i in range(t):
        a = random.randint(2, n-2)
        r = pow(a,n-1,n)
        if r != 1:
            return 1

def is_composite_simple(n):
    if n < 2:
        return False
    
    if n == 2 or n == 3:
        return False
    
    if n % 2 == 0:
        return True
    
    i = 3
    while i * i <= n:
        if n % i == 0:
            return True   # нашли делитель - число составное
        i += 2
    
    return False

def test_ferma(n,t):
    if n < 2:
        print("Число меньше 2")
    elif n == 2 or n == 3:
        print("простое")
    elif n % 2 == 0:
        print("составное чётное")
    else:
        res = test_ferma_count(n, t)
        if res == 1:
            print("составное")
        else:
            print("простое")
            if is_composite_simple(n):
                print("ошибка - составное")
                error_fi(n, t)

def main():
    n = int(input("Введите число для проверки: "))
    t = int(input("Введите параметр надёжности: "))
    test_ferma(n,t)

if __name__ == "__main__":
    main()


#числа кармайкла
#n = 23
#i = 5

#n = 561
#i = 3

#n = 1105
#i = 4


#n = 854501780777821655680788714081287093480547596375411843423320797541830493840928192074537722133187081232367834130096342507467297012917981284864813225410512957619180035613177958673104331914814343967171624127458632994552271037759816301031237962489186973559740929539878996948323821607588369815869388477301
#n = 779961397330450948897130409670002547355397579589659826815909589328283403552957555564852062964790883352608896248217525285183137343311406251209174727532531115623756924948385586401525260275914224328629001388881199996227225408381131559775074997093054203941554864186667055981613373205136966748778294271913
